stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32wl3x_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WL3x_LL_PWR_H
#define STM32WL3x_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x.h"

/** @addtogroup STM32WL3x_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_LOW_PWR_MODE Low Power mode selection
  * @{
  */
#define LL_PWR_MODE_DEEPSTOP               (0x000000000U)   /*!< Low Power Mode Selection DEEPSTOP mode */
#define LL_PWR_MODE_SHUTDOWN               (PWR_CR1_LPMS)   /*!< Low Power Mode Selection SHUTDOWN mode */
/**
  * @}
  */

/** @defgroup PWR_LL_RAMRET RAM Retention enable in Power Save mode
  * @{
  */
#define LL_PWR_RAMRET_1    PWR_CR2_RAMRET1           /*!< RAM1 bank retention in Power Save mode */

/**
  * @}
  */

/** @defgroup PWR_LL_PVDLEVEL PVDLEVEL
  * @{
  */
#define LL_PWR_PVDLEVEL_0                  (0x00000000U)                                     /*!< VPVD0 around 2.0 V */
#define LL_PWR_PVDLEVEL_1                  (PWR_CR2_PVDLS_0)                                 /*!< VPVD1 around 2.2 V */
#define LL_PWR_PVDLEVEL_2                  (PWR_CR2_PVDLS_1)                                 /*!< VPVD2 around 2.4 V */
#define LL_PWR_PVDLEVEL_3                  (PWR_CR2_PVDLS_1 | PWR_CR2_PVDLS_0)               /*!< VPVD3 around 2.5 V */
#define LL_PWR_PVDLEVEL_4                  (PWR_CR2_PVDLS_2)                                 /*!< VPVD4 around 2.6 V */
#define LL_PWR_PVDLEVEL_5                  (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_0)               /*!< VPVD5 around 2.8 V */
#define LL_PWR_PVDLEVEL_6                  (PWR_CR2_PVDLS_2 | PWR_CR2_PVDLS_1)               /*!< VPVD6 around 2.9 V */
#define LL_PWR_PVDLEVEL_7                  (PWR_CR2_PVDLS)                                   /*!< External input analog voltage   (Compare internally to VBGP) */
/**
  * @}
  */

/** @defgroup PWR_LL_WAKEUP_SOURCE_PORT IO Port for wakeup source
  * @{
  */
#define LL_PWR_WAKEUP_PORTA   (0x00000000U)                  /*!< IO port A to get out from DEEPSTOP mode */
#define LL_PWR_WAKEUP_PORTB   (0x00000001U)                  /*!< IO port B to get out from DEEPSTOP mode */
/**
  * @}
  */


/** @defgroup PWR_LL_WAKEUP_SOURCE Wakeup Source
  * @{
  */

#define LL_PWR_WAKEUP_ALL           0x0000FFFF               /*!< Enable all the wakeup source                    */
#define LL_PWR_WAKEUP_PIN0          (uint32_t)(1U << 0U)     /*!< Enable the wakeup source PIN0                   */
#define LL_PWR_WAKEUP_PIN1          (uint32_t)(1U << 1U)     /*!< Enable the wakeup source PIN1                   */
#define LL_PWR_WAKEUP_PIN2          (uint32_t)(1U << 2U)     /*!< Enable the wakeup source PIN2                   */
#define LL_PWR_WAKEUP_PIN3          (uint32_t)(1U << 3U)     /*!< Enable the wakeup source PIN3                   */
#define LL_PWR_WAKEUP_PIN4          (uint32_t)(1U << 4U)     /*!< Enable the wakeup source PIN4                   */
#define LL_PWR_WAKEUP_PIN5          (uint32_t)(1U << 5U)     /*!< Enable the wakeup source PIN5                   */
#define LL_PWR_WAKEUP_PIN6          (uint32_t)(1U << 6U)     /*!< Enable the wakeup source PIN6                   */
#define LL_PWR_WAKEUP_PIN7          (uint32_t)(1U << 7U)     /*!< Enable the wakeup source PIN7                   */
#define LL_PWR_WAKEUP_PIN8          (uint32_t)(1U << 8U)     /*!< Enable the wakeup source PIN8                   */
#define LL_PWR_WAKEUP_PIN9          (uint32_t)(1U << 9U)     /*!< Enable the wakeup source PIN9                   */
#define LL_PWR_WAKEUP_PIN10         (uint32_t)(1U << 10U)    /*!< Enable the wakeup source PIN10                  */
#define LL_PWR_WAKEUP_PIN11         (uint32_t)(1U << 11U)    /*!< Enable the wakeup source PIN11                  */
#define LL_PWR_WAKEUP_PIN12         (uint32_t)(1U << 12U)    /*!< Enable the wakeup source PIN12                  */
#define LL_PWR_WAKEUP_PIN13         (uint32_t)(1U << 13U)    /*!< Enable the wakeup source PIN13                  */
#define LL_PWR_WAKEUP_PIN14         (uint32_t)(1U << 14U)    /*!< Enable the wakeup source PIN14                  */
#define LL_PWR_WAKEUP_PIN15         (uint32_t)(1U << 15U)    /*!< Enable the wakeup source PIN15                  */

#define LL_PWR_WAKEUP_LPAWUR        PWR_IEWU_EWLPAWUR        /*!< Enable wakeup on LPAWUR RFIP event              */
#define LL_PWR_WAKEUP_SUBG          PWR_IEWU_EWMRSUBG        /*!< Enable wakeup on MRSUBG RFIP event              */
#define LL_PWR_WAKEUP_SUBGHOST      PWR_IEWU_EWMRSUBGHCPU    /*!< Enable wakeup on MRSUBG Host CPU event          */
#define LL_PWR_WAKEUP_LCSC          PWR_IEWU_EIWL4           /*!< Enable wakeup on internal event (LCSC)          */
#define LL_PWR_WAKEUP_COMP          PWR_IEWU_EIWL3           /*!< Enable wakeup on internal event (COMP)          */
#define LL_PWR_WAKEUP_LCD           PWR_IEWU_EIWL2           /*!< Enable wakeup on internal event (LCD)           */
#define LL_PWR_WAKEUP_RTC           PWR_IEWU_EIWL1           /*!< Enable wakeup on internal event (RTC)           */
#define LL_PWR_WAKEUP_LPUART        PWR_IEWU_EIWL0           /*!< Enable wakeup on internal event (LPUART)        */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief
  * @{
  */
#define LL_PWR_FLAG_LPAWUR             PWR_IWUF_WLPAWURF                       /*!< LPAWUR wakeup flag                 */
#define LL_PWR_FLAG_MRSUBGHCPU         PWR_IWUF_WMRSUBGHCPUF                   /*!< MRSUBG Host CPU wakeup flag        */
#define LL_PWR_FLAG_MRSUBG             PWR_IWUF_WMRSUBGF                       /*!< MRSUBG wakeup flag                 */
#define LL_PWR_FLAG_LCSC               PWR_IWUF_IWUF4                          /*!< Internal wakeup LCSC flag          */
#define LL_PWR_FLAG_COMP               PWR_IWUF_IWUF3                          /*!< Internal wakeup COMP flag          */
#define LL_PWR_FLAG_LCD                PWR_IWUF_IWUF2                          /*!< Internal wakeup LCD flag           */
#define LL_PWR_FLAG_RTC                PWR_IWUF_IWUF1                          /*!< Internal wakeup RTC flag           */
#define LL_PWR_FLAG_LPUART             PWR_IWUF_IWUF0                          /*!< Internal wakeup LPUART flag        */
#define LL_PWR_WUFA_WUF0               PWR_WUFA_WUF0                           /*!< Wakeup flag on PA0                 */
#define LL_PWR_WUFA_WUF1               PWR_WUFA_WUF1                           /*!< Wakeup flag on PA1                 */
#define LL_PWR_WUFA_WUF2               PWR_WUFA_WUF2                           /*!< Wakeup flag on PA2                 */
#define LL_PWR_WUFA_WUF3               PWR_WUFA_WUF3                           /*!< Wakeup flag on PA3                 */
#define LL_PWR_WUFA_WUF4               PWR_WUFA_WUF4                           /*!< Wakeup flag on PA4                 */
#define LL_PWR_WUFA_WUF5               PWR_WUFA_WUF5                           /*!< Wakeup flag on PA5                 */
#define LL_PWR_WUFA_WUF6               PWR_WUFA_WUF6                           /*!< Wakeup flag on PA6                 */
#define LL_PWR_WUFA_WUF7               PWR_WUFA_WUF7                           /*!< Wakeup flag on PA7                 */
#define LL_PWR_WUFA_WUF8               PWR_WUFA_WUF8                           /*!< Wakeup flag on PA8                 */
#define LL_PWR_WUFA_WUF9               PWR_WUFA_WUF9                           /*!< Wakeup flag on PA9                 */
#define LL_PWR_WUFA_WUF11              PWR_WUFA_WUF11                          /*!< Wakeup flag on PA11                */
#define LL_PWR_WUFA_WUF12              PWR_WUFA_WUF12                          /*!< Wakeup flag on PA12                */
#define LL_PWR_WUFA_WUF13              PWR_WUFA_WUF13                          /*!< Wakeup flag on PA13                */
#define LL_PWR_WUFA_WUF14              PWR_WUFA_WUF14                          /*!< Wakeup flag on PA14                */
#define LL_PWR_WUFA_WUF15              PWR_WUFA_WUF15                          /*!< Wakeup flag on PA15                */
#define LL_PWR_WUFB_WUF0               PWR_WUFB_WUF0                           /*!< Wakeup flag on PB0                 */
#define LL_PWR_WUFB_WUF1               PWR_WUFB_WUF1                           /*!< Wakeup flag on PB1                 */
#define LL_PWR_WUFB_WUF2               PWR_WUFB_WUF2                           /*!< Wakeup flag on PB2                 */
#define LL_PWR_WUFB_WUF3               PWR_WUFB_WUF3                           /*!< Wakeup flag on PB3                 */
#define LL_PWR_WUFB_WUF4               PWR_WUFB_WUF4                           /*!< Wakeup flag on PB4                 */
#define LL_PWR_WUFB_WUF5               PWR_WUFB_WUF5                           /*!< Wakeup flag on PB5                 */
#define LL_PWR_WUFB_WUF6               PWR_WUFB_WUF6                           /*!< Wakeup flag on PB6                 */
#define LL_PWR_WUFB_WUF7               PWR_WUFB_WUF7                           /*!< Wakeup flag on PB7                 */
#define LL_PWR_WUFB_WUF8               PWR_WUFB_WUF8                           /*!< Wakeup flag on PB8                 */
#define LL_PWR_WUFB_WUF9               PWR_WUFB_WUF9                           /*!< Wakeup flag on PB9                 */
#define LL_PWR_WUFB_WUF10              PWR_WUFB_WUF10                          /*!< Wakeup flag on PB10                */
#define LL_PWR_WUFB_WUF11              PWR_WUFB_WUF11                          /*!< Wakeup flag on PB11                */
#define LL_PWR_WUFB_WUF12              PWR_WUFB_WUF12                          /*!< Wakeup flag on PB12                */
#define LL_PWR_WUFB_WUF13              PWR_WUFB_WUF13                          /*!< Wakeup flag on PB13                */
#define LL_PWR_WUFB_WUF14              PWR_WUFB_WUF14                          /*!< Wakeup flag on PB14                */
#define LL_PWR_WUFB_WUF15              PWR_WUFB_WUF15                          /*!< Wakeup flag on PB15                */
#define LL_PWR_SR2_PVDO                PWR_SR2_PVDO                            /*!< Power voltage Detector Output      */
#define LL_PWR_SR2_REGMS               PWR_SR2_REGMS                           /*!< Main regulator ready status        */
#define LL_PWR_SR2_REGLPS              PWR_SR2_REGLPS                          /*!< Low Power regulator ready status   */
#define LL_PWR_SR2_SMPSRDY             PWR_SR2_SMPSRDY                         /*!< SMPS ready status                  */
#define LL_PWR_SR2_SMPSENR             PWR_SR2_SMPSENR                         /*!< SMPS RUN mode status               */
#define LL_PWR_SR2_SMPSBYPR            PWR_SR2_SMPSBYPR                        /*!< SMPS PRECHARGE mode status         */

/**
  * @}
  */

/** @defgroup PWR_LL_IO_PUD_CFG IOs PU/PD configuration
  * @{
  */
#define LL_PWR_GPIO_BIT_0          (uint32_t)(1U << 0U)     /*!< GPIO port I/O pin 0  */
#define LL_PWR_GPIO_BIT_1          (uint32_t)(1U << 1U)     /*!< GPIO port I/O pin 1  */
#define LL_PWR_GPIO_BIT_2          (uint32_t)(1U << 2U)     /*!< GPIO port I/O pin 2  */
#define LL_PWR_GPIO_BIT_3          (uint32_t)(1U << 3U)     /*!< GPIO port I/O pin 3  */
#define LL_PWR_GPIO_BIT_4          (uint32_t)(1U << 4U)     /*!< GPIO port I/O pin 4  */
#define LL_PWR_GPIO_BIT_5          (uint32_t)(1U << 5U)     /*!< GPIO port I/O pin 5  */
#define LL_PWR_GPIO_BIT_6          (uint32_t)(1U << 6U)     /*!< GPIO port I/O pin 6  */
#define LL_PWR_GPIO_BIT_7          (uint32_t)(1U << 7U)     /*!< GPIO port I/O pin 7  */
#define LL_PWR_GPIO_BIT_8          (uint32_t)(1U << 8U)     /*!< GPIO port I/O pin 8  */
#define LL_PWR_GPIO_BIT_9          (uint32_t)(1U << 9U)     /*!< GPIO port I/O pin 9  */
#define LL_PWR_GPIO_BIT_10         (uint32_t)(1U << 10U)    /*!< GPIO port I/O pin 10 */
#define LL_PWR_GPIO_BIT_11         (uint32_t)(1U << 11U)    /*!< GPIO port I/O pin 11 */
#define LL_PWR_GPIO_BIT_12         (uint32_t)(1U << 12U)    /*!< GPIO port I/O pin 12 */
#define LL_PWR_GPIO_BIT_13         (uint32_t)(1U << 13U)    /*!< GPIO port I/O pin 13 */
#define LL_PWR_GPIO_BIT_14         (uint32_t)(1U << 14U)    /*!< GPIO port I/O pin 14 */
#define LL_PWR_GPIO_BIT_15         (uint32_t)(1U << 15U)    /*!< GPIO port I/O pin 15 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GPIO GPIO Port
  * @{
  */
#define LL_PWR_GPIO_A                ((uint32_t)(&(PWR->PUCRA)))
#define LL_PWR_GPIO_B                ((uint32_t)(&(PWR->PUCRB)))

/**
  * @}
  */

