stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_pwr.h
/** @defgroup PWR_LL_WAKEUP_CFG IOs Wakeup configuration polarity
  * @{
  */
#define LL_PWR_WUP_RISIEDG (0x000000000U)   /*!< Detection of wakeup event on rising edge.  */
#define LL_PWR_WUP_FALLEDG (0x000000001U)   /*!< Detection of wakeup event on falling edge. */
/**
  * @}
  */

/** @defgroup PWR_LL_IO_LATCH_BOOT I/Os value latched at POR.
  * @{
  */
#define LL_PWR_PA8_LATCH_POR    PWR_SR2_IOBOOTVAL_0  /*!< PA8  input value latched at POR. */
#define LL_PWR_PA9_LATCH_POR    PWR_SR2_IOBOOTVAL_1  /*!< PA9  input value latched at POR. */
#define LL_PWR_PA10_LATCH_POR   PWR_SR2_IOBOOTVAL_2  /*!< PA10 input value latched at POR. */
#define LL_PWR_PA11_LATCH_POR   PWR_SR2_IOBOOTVAL_3  /*!< PA11 input value latched at POR. */
#if defined(PWR_SR2_IOBOOTVAL2_0)
#define LL_PWR_PB12_LATCH_POR   PWR_SR2_IOBOOTVAL2_0 /*!< PB12  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_0 */
#if defined(PWR_SR2_IOBOOTVAL2_1)
#define LL_PWR_PB13_LATCH_POR   PWR_SR2_IOBOOTVAL2_1 /*!< PB13  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_1 */
#if defined(PWR_SR2_IOBOOTVAL2_2)
#define LL_PWR_PB14_LATCH_POR   PWR_SR2_IOBOOTVAL2_2 /*!< PB14  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_2 */
#if defined(PWR_SR2_IOBOOTVAL2_3)
#define LL_PWR_PB15_LATCH_POR   PWR_SR2_IOBOOTVAL2_3 /*!< PB15  input value latched at POR. */
#endif /* PWR_SR2_IOBOOTVAL2_3 */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_MODE SMPS Mode
  * @{
  */
#define LL_PWR_SMPS       (0x000000000U)   /*!< SMPS is enabled     */
#define LL_PWR_NO_SMPS    PWR_CR5_NOSMPS   /*!< SMPS is disabled    */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_PRECHARGE_MODE SMPS PRECHARGE Mode
  * @{
  */
#define LL_PWR_NO_SMPS_PRECHARGE    (0x000000000U)     /*!< SMPS not in pecharge mode     */
#define LL_PWR_SMPS_PRECHARGE       PWR_CR5_SMPSFBYP   /*!< SMPS is disabled and bypassed in precharge mode    */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_BOF_MODE SMPS BOF Mode
  * @{
  */
#define LL_PWR_NO_SMPS_BOF    (0x000000000U)     /*!< SMPS BOF mode not enabled */
#define LL_PWR_SMPS_BOF       PWR_CR5_NOSMPSBOF  /*!< SMPS BOF mode enable      */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_BOF_STATIC_MODE SMPS BOF STATIC Mode
  * @{
  */
#define LL_PWR_NO_SMPS_BOF_STATIC    (0x000000000U)           /*!< SMPS BOF static mode not enabled */
#define LL_PWR_SMPS_BOF_STATIC       PWR_CR5_SMPS_BOF_STATIC  /*!< SMPS BOF static mode enable      */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_BOF_DYNAMIC_MODE SMPS BOF DYNAMIC Mode
  * @{
  */
#define LL_PWR_NO_SMPS_BOF_DYNAMIC    (0x000000000U)         /*!< SMPS BOF dynamic mode not enabled */
#define LL_PWR_SMPS_BOF_DYNAMIC       PWR_CR5_SMPS_BOF_DYN   /*!< SMPS BOF dynamic mode enable      */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_OPEN_MODE SMPS OPEN Mode during DEEPSTOP
  * @{
  */
#define LL_PWR_NO_SMPS_LPOPEN    (0x000000000U)      /*!< In DEEPSTOP, the SMPS is in PRECHARGE mode with output connected to VDDIO */
#define LL_PWR_SMPS_LPOPEN       PWR_CR5_SMPSLPOPEN  /*!< In DEEPSTOP, the SMPS is disabled with floating output                    */
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_BOM SMPS BOM
  * @{
  */
#define LL_PWR_SMPS_BOM1       (0x000000000U)
#define LL_PWR_SMPS_BOM2       PWR_CR5_SMPSBOMSEL_0
#define LL_PWR_SMPS_BOM3       PWR_CR5_SMPSBOMSEL_1
/**
  * @}
  */

/** @defgroup PWR_LL_SMPS_OUTLVL SMPS Output Level
  * @{
  */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V20              (0x00000000U )                                                             /*!< 0000: 1.20V (min VBAT = 1.95V)           */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V30              (PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0 )                                     /*!< 0011: 1.30V (min VBAT = 1.95V)           */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40              (PWR_CR5_SMPSLVL_2)                                                        /*!< 0100: 1.40V (min VBAT = 1.95V) (default) */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V50              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)                                      /*!< 0101: 1.50V (min VBAT = 1.95V)           */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V60              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1)                                      /*!< 0110: 1.60V (min VBAT = 1.95V)           */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V70              (PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)                    /*!< 0111: 1.70V (min VBAT = 2V)              */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V80              (PWR_CR5_SMPSLVL_3)                                                        /*!< 1000: 1.80V (min VBAT = 2.1V)            */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_1V90              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_0)                                      /*!< 1001: 1.90V (min VBAT = 2.2V)            */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_2V00              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1)                                      /*!< 1010: 2V (min VBAT = 2.3V)               */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_2V10              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)                    /*!< 1011: 2.1V (min VBAT = 2.4V)             */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_2V20              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2)                                      /*!< 1100: 2.2V (min VBAT = 2.5V)             */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_2V30              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_0)                    /*!< 1101: 2.3V (min VBAT = 2.6V)             */
#define LL_PWR_SMPS_OUTPUT_VOLTAGE_2V40              (PWR_CR5_SMPSLVL_3|PWR_CR5_SMPSLVL_2|PWR_CR5_SMPSLVL_1|PWR_CR5_SMPSLVL_0)  /*!< 1111: 2.4V (min VBAT = 2.7V)             */

/**
  * @}
  */

#if defined(PWR_CR5_SMPS_PRECH_CUR_SEL)
/** @defgroup PWR_LL_SMPS_PRECHARGE_LIMIT_CURRENT Select SMPS PRECHARGE limit current
  * @{
  */
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_2_5     (0x000000000U)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_5       (PWR_CR5_SMPS_PRECH_CUR_SEL_0)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_10      (PWR_CR5_SMPS_PRECH_CUR_SEL_1)
#define LL_PWR_SMPS_PRECH_LIMIT_CUR_20      (PWR_CR5_SMPS_PRECH_CUR_SEL_0|PWR_CR5_SMPS_PRECH_CUR_SEL_1)
/**
  * @}
  */
#endif /* PWR_CR5_SMPS_PRECH_CUR_SEL */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Macros PWR Exported Macros
  * @{
  */

/** @defgroup PWR_LL_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in PWR register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_PWR_WriteReg(__REG__, __VALUE__) WRITE_REG(PWR->__REG__, (__VALUE__))

/**
  * @brief  Read a value in PWR register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_PWR_ReadReg(__REG__) READ_REG(PWR->__REG__)
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_Configuration Configuration Function
  * @{
  */

/**
  * @brief  Enable automatic IBIAS control during RUN or DEEPSTOP mode.
  * @rmtoll CR1          IBIAS_RUN_AUTO           LL_PWR_EnableIBIASAuto
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableIBIASAuto(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_IBIAS_RUN_AUTO);
}

/**
  * @brief  Disable automatic IBIAS control during RUN or DEEPSTOP mode.
  * @rmtoll CR1          IBIAS_RUN_AUTO           LL_PWR_DisableIBIASAuto
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableIBIASAuto(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_IBIAS_RUN_AUTO);
}

/**
  * @brief  Checks if automatic IBIAS control during RUN or DEEPSTOP mode is enabled or disabled.
  * @rmtoll CR1         IBIAS_RUN_AUTO      LL_PWR_IsEnabledIBIASAuto
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledIBIASAuto(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_IBIAS_RUN_AUTO) == (PWR_CR1_IBIAS_RUN_AUTO)) ? 1UL : 0UL);
}

/**
  * @brief  Enable IBIAS during RUN mode when automatic mode is disabled.
  * @rmtoll CR1          IBIAS_RUN_STATE           LL_PWR_EnableIBIASRun
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableIBIASRun(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_IBIAS_RUN_STATE);
}

/**
  * @brief  Disable IBIAS during RUN mode when automatic mode is disabled.
  * @rmtoll CR1          IBIAS_RUN_STATE           LL_PWR_DisableIBIASRun
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableIBIASRun(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_IBIAS_RUN_STATE);
}

/**
  * @brief  Checks if IBIAS is enabled or disabled, during RUN mode when automatic mode is disabled.
  * @rmtoll CR1         IBIAS_RUN_STATE      LL_PWR_IsEnabledIBIASRun
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledIBIASRun(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_IBIAS_RUN_STATE) == (PWR_CR1_IBIAS_RUN_STATE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the BOR reset supervising during SHUTDOWN mode.
  * @rmtoll CR1          ENSDNBOR           LL_PWR_EnableBORinSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBORinSDN(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_ENSDNBOR);
}

/**
  * @brief  Disable the BOR reset supervising during SHUTDOWN mode.
  * @rmtoll CR1          ENSDNBOR           LL_PWR_DisableBORinSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBORinSDN(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_ENSDNBOR);
}

/**
  * @brief  Checks if BOR is enabled or disabled during SHUTDOWN mode.
  * @rmtoll CR1         ENSDNBOR      LL_PWR_IsEnabledBORinSDN
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBORinSDN(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_ENSDNBOR) == (PWR_CR1_ENSDNBOR)) ? 1UL : 0UL);
}

#if defined(PWR_SDWN_WUEN_WUEN)
/**
  * @brief  Shutdown I/O Wakeup enable.
  * @rmtoll SDWN_WUEN          WUEN           LL_PWR_EnableIOWakeupSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableIOWakeupSDN(void)
{
  SET_BIT(PWR->SDWN_WUEN, PWR_SDWN_WUEN_WUEN);
}

/**
  * @brief  Shutdown I/O Wakeup disable.
  * @rmtoll SDWN_WUEN          WUEN           LL_PWR_DisableIOWakeupSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableIOWakeupSDN(void)
{
  CLEAR_BIT(PWR->SDWN_WUEN, PWR_SDWN_WUEN_WUEN);
}

/**
  * @brief  Checks if Shutdown I/O Wakeup is enabled or disabled.
  * @rmtoll SDWN_WUEN         WUEN     LL_PWR_IsEnabledIOWakeupSDN
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledIOWakeupSDN(void)
{
  return ((READ_BIT(PWR->SDWN_WUEN, PWR_SDWN_WUEN_WUEN) == (PWR_SDWN_WUEN_WUEN)) ? 1UL : 0UL);
}

/**
  * @brief  Shutdown I/O Wakeup Polarity configuration.
  * @rmtoll SDWN_WUPOL          WUPOL           LL_PWR_IOWakeupPolaritySDN
  * @param  pol IO wakeup polarity. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WUP_RISIEDG
  *         @arg @ref LL_PWR_WUP_FALLEDG
  * @retval None
  * @note The wakeup from shutdown can happen on pulse or level detection
  */
__STATIC_INLINE void LL_PWR_IOWakeupPolaritySDN(uint8_t pol)
{
  MODIFY_REG_FIELD(PWR->SDWN_WUPOL, PWR_SDWN_WUPOL_WUPOL, pol);
}

/**
  * @brief  Checks if Shutdown I/O Wakeup from PB0 pin occurred.
  * @rmtoll SDWN_WUF         WUF     LL_PWR_IsIOWakeupSDN
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsIOWakeupSDN(void)
{
  return ((READ_BIT(PWR->SDWN_WUF, PWR_SDWN_WUF_WUF) == (PWR_SDWN_WUF_WUF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear I/O Wakeup from PB0 pin occurred flag
  * @rmtoll SDWN_WUF          WUF           LL_PWR_ClearIOWakeupFlagSDN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearIOWakeupFlagSDN(void)
{
  CLEAR_BIT(PWR->SDWN_WUF, PWR_SDWN_WUF_WUF);
}
#endif /* PWR_SDWN_WUEN_WUEN */

/**
  * @brief  Select the low-power mode.
  * @rmtoll CR1          LPMS           LL_PWR_LowPowerMode
  * @param  LowPowerMode Low Power Mode Selection. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_MODE_DEEPSTOP
  *         @arg @ref LL_PWR_MODE_SHUTDOWN
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPowerMode(uint32_t LowPowerMode)
{
  MODIFY_REG_FIELD(PWR->CR1, PWR_CR1_LPMS, LowPowerMode);
}

/**
  * @brief  Get Low-Power mode
  * @rmtoll CR1          LPMS          LL_PWR_GetPowerMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_MODE_DEEPSTOP
  *         @arg @ref LL_PWR_MODE_SHUTDOWN
  */

__STATIC_INLINE uint32_t LL_PWR_GetPowerMode(void)
{
  return (uint32_t)(READ_BIT(PWR->CR1, PWR_CR1_LPMS));
}

/**
  * @brief  Enabled the temperature sensor.
  * @rmtoll CR2          ENTS           LL_PWR_EnableTempSens
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableTempSens(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_ENTS);
}

/**
  * @brief  Disable the temperature sensor.
  * @rmtoll CR2          ENTS           LL_PWR_DisableTempSens
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableTempSens(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_ENTS);
}

/**
  * @brief  Checks if temperature sensor is enabled or disabled.
  * @rmtoll CR2         ENTS     LL_PWR_IsEnabledTempSens
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledTempSens(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_ENTS) == (PWR_CR2_ENTS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the RAM bank retention.
  * @rmtoll CR2         RAMRET1      LL_PWR_EnableRAMBankRet
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableRAMBankRet(void)
{
  SET_BIT(PWR->CR2, LL_PWR_RAMRET_1);
}

/**
  * @brief  Disable the RAM bank retention.
  * @rmtoll CR2         RAMRET1      LL_PWR_DisableRAMBankRet
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableRAMBankRet(void)
{
  CLEAR_BIT(PWR->CR2, LL_PWR_RAMRET_1);
}

/**
  * @brief  Get the RAM banks retention selected.
  * @rmtoll CR2         RAMRET1       LL_PWR_GetRAMBankRet
  * @retval RAM bank selection. This parameter can be the following value:
  *         @arg @ref LL_PWR_RAMRET_1
  */
__STATIC_INLINE uint32_t LL_PWR_GetRAMBankRet(void)
{
  return (READ_BIT(PWR->CR2, PWR_CR2_RAMRET1) ? 1UL : 0UL);
}

/**
  * @brief  Enable the PVD (Programmable Voltage Detector).
  * @rmtoll CR2          PVDE           LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_PVDE);
}

/**
  * @brief  Disable the PVD (Programmable Voltage Detector).
  * @rmtoll CR2          PVDE           LL_PWR_DisablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_PVDE);
}

/**
  * @brief  Checks if PVD is enabled or disabled.
  * @rmtoll CR2         PVDE      LL_PWR_IsEnabledPVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_PVDE) == (PWR_CR2_PVDE)) ? 1UL : 0UL);
}

/**
  * @brief  Set PVD voltage level.
  * @rmtoll CR2         PVDLS      LL_PWR_SetPVDLevel
  * @param  PVDLevel PVD voltage level selection. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPVDLevel(uint32_t PVDLevel)
{
  MODIFY_REG(PWR->CR2, PWR_CR2_PVDLS, PVDLevel);
}

/**
  * @brief  Get PVD voltage level.
  * @rmtoll CR2         PVDLS      LL_PWR_GetPVDLevel
  * @retval PVD voltage level selection. The parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_0
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  */
__STATIC_INLINE uint32_t LL_PWR_GetPVDLevel(void)
{
  return (uint32_t)(READ_BIT(PWR->CR2, PWR_CR2_PVDLS));
}

/**
  * @brief  Enable IO Wakeup Source to get out of DEEPSTOP mode.
  * @rmtoll EWUA             LL_PWR_EnableWakeUpPin
  *         EWUB             LL_PWR_EnableWakeUpPin
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin Enable the wakeup sources. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN0
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN6
  *         @arg @ref LL_PWR_WAKEUP_PIN7
  *         @arg @ref LL_PWR_WAKEUP_PIN8
  *         @arg @ref LL_PWR_WAKEUP_PIN9
  *         @arg @ref LL_PWR_WAKEUP_PIN10
  *         @arg @ref LL_PWR_WAKEUP_PIN11
  *         @arg @ref LL_PWR_WAKEUP_PIN12
  *         @arg @ref LL_PWR_WAKEUP_PIN13
  *         @arg @ref LL_PWR_WAKEUP_PIN14
  *         @arg @ref LL_PWR_WAKEUP_PIN15
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    SET_BIT(PWR->EWUA, (WakeUpPin & 0x0000FFFF));
  }
  else
  {
    SET_BIT(PWR->EWUB, (WakeUpPin & 0x0000FFFF));
  }
}

/**
  * @brief  Disable IO Wakeup Source to get out of DEEPSTOP mode.
  * @rmtoll EWUA             LL_PWR_DisableWakeUpPin
  *         EWUB             LL_PWR_DisableWakeUpPin
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin Disable the wakeup sources. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN0
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN6
  *         @arg @ref LL_PWR_WAKEUP_PIN7
  *         @arg @ref LL_PWR_WAKEUP_PIN8
  *         @arg @ref LL_PWR_WAKEUP_PIN9
  *         @arg @ref LL_PWR_WAKEUP_PIN10
  *         @arg @ref LL_PWR_WAKEUP_PIN11
  *         @arg @ref LL_PWR_WAKEUP_PIN12
  *         @arg @ref LL_PWR_WAKEUP_PIN13
  *         @arg @ref LL_PWR_WAKEUP_PIN14
  *         @arg @ref LL_PWR_WAKEUP_PIN15
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    CLEAR_BIT(PWR->EWUA, (WakeUpPin & 0x0000FFFF));
  }
  else
  {
    CLEAR_BIT(PWR->EWUB, (WakeUpPin & 0x0000FFFF));
  }
}

/**
  * @brief  Check if the WakeUp PINx functionality is enabled
  * @rmtoll EWUA/EWUB        LL_PWR_IsEnabledWakeUpPin
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin Wakeup sources enabled. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN0
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN6
  *         @arg @ref LL_PWR_WAKEUP_PIN7
  *         @arg @ref LL_PWR_WAKEUP_PIN8
  *         @arg @ref LL_PWR_WAKEUP_PIN9
  *         @arg @ref LL_PWR_WAKEUP_PIN10
  *         @arg @ref LL_PWR_WAKEUP_PIN11
  *         @arg @ref LL_PWR_WAKEUP_PIN12
  *         @arg @ref LL_PWR_WAKEUP_PIN13
  *         @arg @ref LL_PWR_WAKEUP_PIN14
  *         @arg @ref LL_PWR_WAKEUP_PIN15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    return ((READ_BIT(PWR->EWUA, (WakeUpPin & 0x0000FFFF)) == (WakeUpPin & 0x0000FFFF)) ? 1UL : 0UL);
  }
  else
  {
    return ((READ_BIT(PWR->EWUB, (WakeUpPin & 0x0000FFFF)) == (WakeUpPin & 0x0000FFFF)) ? 1UL : 0UL);
  }
}

/**
  * @brief  Set the Wake-Up pin polarity low for the event detection.
  * @rmtoll WUPA/WUPB              LL_PWR_SetWakeUpPinPolarityLow
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin wakeup sources to configure. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN0
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN6
  *         @arg @ref LL_PWR_WAKEUP_PIN7
  *         @arg @ref LL_PWR_WAKEUP_PIN8
  *         @arg @ref LL_PWR_WAKEUP_PIN9
  *         @arg @ref LL_PWR_WAKEUP_PIN10
  *         @arg @ref LL_PWR_WAKEUP_PIN11
  *         @arg @ref LL_PWR_WAKEUP_PIN12
  *         @arg @ref LL_PWR_WAKEUP_PIN13
  *         @arg @ref LL_PWR_WAKEUP_PIN14
  *         @arg @ref LL_PWR_WAKEUP_PIN15
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityLow(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    SET_BIT(PWR->WUPA, (WakeUpPin & 0x0000FFFF));
  }
  else
  {
    SET_BIT(PWR->WUPB, (WakeUpPin & 0x0000FFFF));
  }
}

/**
  * @brief  Set the polarity for the I/Os wakeup sources.
  * @rmtoll WUPA/WUPB               LL_PWR_SetWakeUpPinPolarityHigh
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin IO to configure. This parameter can be a
  *         combination of the following values @arg @ref PWR_LL_WAKEUP_SOURCE
  * @retval None
  * @note   Please refer the user manual to know which wakeup source are able for this
  *         feature.
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityHigh(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    CLEAR_BIT(PWR->WUPA, (WakeUpPin & 0x0000FFFF));
  }
  else
  {
    CLEAR_BIT(PWR->WUPB, (WakeUpPin & 0x0000FFFF));
  }
}

