stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_pwr.h
/**
  * @brief  Get the polarity for the I/Os wakeup sources.
  * @rmtoll WUPA/WUPB              LL_PWR_IsWakeUpPinPolarity
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin IO wakeup sources configured. This parameter can be a one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN0
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN6
  *         @arg @ref LL_PWR_WAKEUP_PIN7
  *         @arg @ref LL_PWR_WAKEUP_PIN8
  *         @arg @ref LL_PWR_WAKEUP_PIN9
  *         @arg @ref LL_PWR_WAKEUP_PIN10
  *         @arg @ref LL_PWR_WAKEUP_PIN11
  *         @arg @ref LL_PWR_WAKEUP_PIN12
  *         @arg @ref LL_PWR_WAKEUP_PIN13
  *         @arg @ref LL_PWR_WAKEUP_PIN14
  *         @arg @ref LL_PWR_WAKEUP_PIN15
  * @retval The IO polarity to configure. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WUP_RISIEDG
  *         @arg @ref LL_PWR_WUP_FALLEDG
  */
__STATIC_INLINE uint32_t LL_PWR_IsWakeUpPinPolarity(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    return (uint32_t)((READ_BIT(PWR->WUPA, (WakeUpPin & 0x0000FFFF))) ? 1UL : 0UL);
  }
  else
  {
    return (uint32_t)((READ_BIT(PWR->WUPB, (WakeUpPin & 0x0000FFFF))) ? 1UL : 0UL);
  }
}

/**
  * @brief  Get which IO source woken up the device after a DEEPSTOP.
  * @rmtoll WUFA/WUFB               LL_PWR_GetIOWakeupSource
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @retval Wakeup IO Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN0
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  *         @arg @ref LL_PWR_WAKEUP_PIN5
  *         @arg @ref LL_PWR_WAKEUP_PIN6
  *         @arg @ref LL_PWR_WAKEUP_PIN7
  *         @arg @ref LL_PWR_WAKEUP_PIN8
  *         @arg @ref LL_PWR_WAKEUP_PIN9
  *         @arg @ref LL_PWR_WAKEUP_PIN10
  *         @arg @ref LL_PWR_WAKEUP_PIN11
  *         @arg @ref LL_PWR_WAKEUP_PIN12
  *         @arg @ref LL_PWR_WAKEUP_PIN13
  *         @arg @ref LL_PWR_WAKEUP_PIN14
  *         @arg @ref LL_PWR_WAKEUP_PIN15
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeupSource(uint32_t Port)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    return (uint32_t)(READ_REG(PWR->WUFA) & 0x0000FFFF);
  }
  else
  {
    return (uint32_t)(READ_REG(PWR->WUFB) & 0x0000FFFF);
  }
}

/**
  * @brief  Clear the source that woken up the device after a DEEPSTOP.
  * @rmtoll WUFA/WUFB              LL_PWR_ClearWakeupSource
  * @param  Port IO port to get out of DEEPSTOP mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PORTA
  *         @arg @ref LL_PWR_WAKEUP_PORTB
  * @param  WakeUpPin Wakeup IO Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WUFA_WUF0
  *         @arg @ref LL_PWR_WUFA_WUF1
  *         @arg @ref LL_PWR_WUFA_WUF2
  *         @arg @ref LL_PWR_WUFA_WUF3
  *         @arg @ref LL_PWR_WUFA_WUF4
  *         @arg @ref LL_PWR_WUFA_WUF5
  *         @arg @ref LL_PWR_WUFA_WUF6
  *         @arg @ref LL_PWR_WUFA_WUF7
  *         @arg @ref LL_PWR_WUFA_WUF8
  *         @arg @ref LL_PWR_WUFA_WUF9
  *         @arg @ref LL_PWR_WUFA_WUF11
  *         @arg @ref LL_PWR_WUFA_WUF12
  *         @arg @ref LL_PWR_WUFA_WUF13
  *         @arg @ref LL_PWR_WUFA_WUF14
  *         @arg @ref LL_PWR_WUFA_WUF15
  *         @arg @ref LL_PWR_WUFB_WUF0
  *         @arg @ref LL_PWR_WUFB_WUF1
  *         @arg @ref LL_PWR_WUFB_WUF2
  *         @arg @ref LL_PWR_WUFB_WUF3
  *         @arg @ref LL_PWR_WUFB_WUF4
  *         @arg @ref LL_PWR_WUFB_WUF5
  *         @arg @ref LL_PWR_WUFB_WUF6
  *         @arg @ref LL_PWR_WUFB_WUF7
  *         @arg @ref LL_PWR_WUFB_WUF8
  *         @arg @ref LL_PWR_WUFB_WUF9
  *         @arg @ref LL_PWR_WUFB_WUF10
  *         @arg @ref LL_PWR_WUFB_WUF11
  *         @arg @ref LL_PWR_WUFB_WUF12
  *         @arg @ref LL_PWR_WUFB_WUF14
  *         @arg @ref LL_PWR_WUFB_WUF15
  */
__STATIC_INLINE void LL_PWR_ClearWakeupSource(uint32_t Port, uint32_t WakeUpPin)
{
  if (Port == LL_PWR_WAKEUP_PORTA)
  {
    WRITE_REG(PWR->WUFA, (WakeUpPin & 0x0000FFFF));
  }
  else
  {
    WRITE_REG(PWR->WUFB, (WakeUpPin & 0x0000FFFF));
  }
}

/**
  * @brief  Enable Internal Wakeup Source to get out of DEEPSTOP mode.
  * @rmtoll IEWU             LL_PWR_EnableInternWU
  * @param  WakeUpSource Enable the internal wakeup sources.
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_LPAWUR
  *         @arg @ref LL_PWR_WAKEUP_SUBG
  *         @arg @ref LL_PWR_WAKEUP_SUBGHOST
  *         @arg @ref LL_PWR_WAKEUP_LCSC
  *         @arg @ref LL_PWR_WAKEUP_COMP
  *         @arg @ref LL_PWR_WAKEUP_LCD
  *         @arg @ref LL_PWR_WAKEUP_RTC
  *         @arg @ref LL_PWR_WAKEUP_LPUART
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableInternWU(uint32_t WakeUpSource)
{
  SET_BIT(PWR->IEWU, (WakeUpSource & 0x0000FFFF));
}

/**
  * @brief  Disable Internal Wakeup Source to get out of DEEPSTOP mode.
  * @rmtoll IEWU            LL_PWR_DisableInternWU
  * @param  WakeUpSource Disable the internal wakeup sources.
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_LPAWUR
  *         @arg @ref LL_PWR_WAKEUP_SUBG
  *         @arg @ref LL_PWR_WAKEUP_SUBGHOST
  *         @arg @ref LL_PWR_WAKEUP_LCSC
  *         @arg @ref LL_PWR_WAKEUP_COMP
  *         @arg @ref LL_PWR_WAKEUP_LCD
  *         @arg @ref LL_PWR_WAKEUP_RTC
  *         @arg @ref LL_PWR_WAKEUP_LPUART
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableInternWU(uint32_t WakeUpSource)
{
  CLEAR_BIT(PWR->IEWU, (WakeUpSource & 0x0000FFFF));
}

/**
  * @brief  Is Internal Wakeup Source enabled.
  * @rmtoll IEWU         LL_PWR_IsEnabledInternWU
  * @param  WakeUpSource Wakeup sources enabled. This parameter can be a one the following values:
  *         @arg @ref LL_PWR_WAKEUP_LPAWUR
  *         @arg @ref LL_PWR_WAKEUP_SUBG
  *         @arg @ref LL_PWR_WAKEUP_SUBGHOST
  *         @arg @ref LL_PWR_WAKEUP_LCSC
  *         @arg @ref LL_PWR_WAKEUP_COMP
  *         @arg @ref LL_PWR_WAKEUP_LCD
  *         @arg @ref LL_PWR_WAKEUP_RTC
  *         @arg @ref LL_PWR_WAKEUP_LPUART
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledInternWU(uint32_t WakeUpSource)
{
  return ((READ_BIT(PWR->IEWU, (WakeUpSource & 0x0000FFFF)) == (WakeUpSource & 0x0000FFFF)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Polarity for the Internal wakeup sources.
  * @rmtoll IWUP               LL_PWR_SetWakeupInternalPolarity
  * @param  WakeUpSource Internal wakeup sources to configure.
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_LPAWUR
  *         @arg @ref LL_PWR_WAKEUP_SUBG
  *         @arg @ref LL_PWR_WAKEUP_SUBGHOST
  *         @arg @ref LL_PWR_WAKEUP_LCSC
  *         @arg @ref LL_PWR_WAKEUP_COMP
  *         @arg @ref LL_PWR_WAKEUP_LCD
  *         @arg @ref LL_PWR_WAKEUP_RTC
  *         @arg @ref LL_PWR_WAKEUP_LPUART
  * @param  Polarity Internal polarity to configure. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WUP_RISIEDG
  *         @arg @ref LL_PWR_WUP_FALLEDG
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeupInternalPolarity(uint32_t WakeUpSource, uint32_t Polarity)
{
  if (Polarity == LL_PWR_WUP_FALLEDG)
  {
    SET_BIT(PWR->IWUP, (WakeUpSource & 0x0000FFFF));
  }
  else
  {
    CLEAR_BIT(PWR->IWUP, (WakeUpSource & 0x0000FFFF));
  }
}

/**
  * @brief  Get the polarity for the Internal wakeup sources.
  * @rmtoll IWUP                 LL_PWR_GetWakeupInternalPolarity
  * @param  WakeUpSource Internal wakeup sources configured. This parameter can be a one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_LPAWUR
  *         @arg @ref LL_PWR_WAKEUP_SUBG
  *         @arg @ref LL_PWR_WAKEUP_SUBGHOST
  *         @arg @ref LL_PWR_WAKEUP_LCSC
  *         @arg @ref LL_PWR_WAKEUP_COMP
  *         @arg @ref LL_PWR_WAKEUP_LCD
  *         @arg @ref LL_PWR_WAKEUP_RTC
  *         @arg @ref LL_PWR_WAKEUP_LPUART
  * @retval The Internal polarity configured. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WUP_RISIEDG
  *         @arg @ref LL_PWR_WUP_FALLEDG
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeupInternalPolarity(uint32_t WakeUpSource)
{
  return (uint32_t)((READ_BIT(PWR->IWUP, (WakeUpSource & 0x0000FFFF))) ? 1UL : 0UL);
}

/**
  * @brief  Get which Internal source woken up the device after a DEEPSTOP.
  * @rmtoll IWUF                LL_PWR_GetInternalWakeupSource
  * @retval Internal Wakeup Source from DEEPSTOP. This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_FLAG_LPAWUR
  *         @arg @ref LL_PWR_FLAG_MRSUBGHCPU
  *         @arg @ref LL_PWR_FLAG_MRSUBG
  *         @arg @ref LL_PWR_FLAG_LCSC
  *         @arg @ref LL_PWR_FLAG_COMP
  *         @arg @ref LL_PWR_FLAG_LCD
  *         @arg @ref LL_PWR_FLAG_RTC
  *         @arg @ref LL_PWR_FLAG_LPUART
  */
__STATIC_INLINE uint32_t LL_PWR_GetInternalWakeupSource(void)
{
  return (uint32_t)(READ_REG(PWR->IWUF) & 0x0000FFFF);
}

/**
  * @brief  Clear the Internal source that woken up the device after a DEEPSTOP.
  * @rmtoll IWUF                 LL_PWR_ClearInternalWakeupSource
  * @param  WakeUpSource Internal Wakeup Source from DEEPSTOP.
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_FLAG_LPAWUR
  *         @arg @ref LL_PWR_FLAG_MRSUBGHCPU
  *         @arg @ref LL_PWR_FLAG_MRSUBG
  *         @arg @ref LL_PWR_FLAG_LCSC
  *         @arg @ref LL_PWR_FLAG_COMP
  *         @arg @ref LL_PWR_FLAG_LCD
  *         @arg @ref LL_PWR_FLAG_RTC
  *         @arg @ref LL_PWR_FLAG_LPUART
  */
__STATIC_INLINE void LL_PWR_ClearInternalWakeupSource(uint32_t WakeUpSource)
{
  WRITE_REG(PWR->IWUF, (WakeUpSource & 0x0000FFFF));
}

/**
  * @brief  Get LPUART Flag
  * @rmtoll IWUF          IWUF0           LL_PWR_IsActiveFlag_LPUART
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_LPUART(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_IWUF0) == (PWR_IWUF_IWUF0)) ? 1UL : 0UL);
}

/**
  * @brief  Get RTC Flag
  * @rmtoll IWUF          IWUF1           LL_PWR_IsActiveFlag_RTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_RTC(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_IWUF1) == (PWR_IWUF_IWUF1)) ? 1UL : 0UL);
}

/**
  * @brief  Get LCD Flag
  * @rmtoll IWUF          IWUF2           LL_PWR_IsActiveFlag_LCD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_LCD(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_IWUF2) == (PWR_IWUF_IWUF2)) ? 1UL : 0UL);
}

/**
  * @brief  Get COMP Flag
  * @rmtoll IWUF          IWUF3           LL_PWR_IsActiveFlag_COMP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_COMP(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_IWUF3) == (PWR_IWUF_IWUF3)) ? 1UL : 0UL);
}

/**
  * @brief  Get LCSC Flag
  * @rmtoll IWUF          IWUF4           LL_PWR_IsActiveFlag_LCSC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_LCSC(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_IWUF4) == (PWR_IWUF_IWUF4)) ? 1UL : 0UL);
}

/**
  * @brief  Get MRSUBG Flag
  * @rmtoll IWUF          WMRSUBGF           LL_PWR_IsActiveFlag_MRSUBG
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_MRSUBG(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGF) == (PWR_IWUF_WMRSUBGF)) ? 1UL : 0UL);
}

/**
  * @brief  Get MRSUBG Host CPU Flag
  * @rmtoll IWUF          WMRSUBGHCPUF           LL_PWR_IsActiveFlag_WMRSUBGHCPU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_MRSUBGHCPU(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_WMRSUBGHCPUF) == (PWR_IWUF_WMRSUBGHCPUF)) ? 1UL : 0UL);
}

/**
  * @brief  Get LPAWUR Flag
  * @rmtoll IWUF          WLPAWURF           LL_PWR_IsActiveFlag_LPAWUR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_LPAWUR(void)
{
  return ((READ_BIT(PWR->IWUF, PWR_IWUF_WLPAWURF) == (PWR_IWUF_WLPAWURF)) ? 1UL : 0UL);
}

/**
  * @brief  Get IO BOOT value.
  * @rmtoll SR2               LL_PWR_GetIOBootVal
  * @param  IO This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PA8_LATCH_POR
  *         @arg @ref LL_PWR_PA9_LATCH_POR
  *         @arg @ref LL_PWR_PA10_LATCH_POR
  *         @arg @ref LL_PWR_PA11_LATCH_POR
  *         @arg @ref LL_PWR_PB12_LATCH_POR
  *         @arg @ref LL_PWR_PB13_LATCH_POR
  *         @arg @ref LL_PWR_PB14_LATCH_POR
  *         @arg @ref LL_PWR_PB15_LATCH_POR
  * @retval State of pin (1 or 0).
  * @note   Please refer the user manual to know which IOs are able for this
  *         feature.
  */
__STATIC_INLINE uint32_t LL_PWR_GetIOBootVal(uint32_t IO)
{
  return ((READ_BIT(PWR->SR2, IO) == (IO)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether VDD voltage is below or above the selected PVD threshold
  * @rmtoll SR2       PVDO         LL_PWR_IsActiveFlag_PVDO
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_PVDO(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_PVDO) == (PWR_SR2_PVDO)) ? 1UL : 0UL);
}

/**
  * @brief  Get the Main Regulator ready status.
  * @rmtoll SR2       REGMS         LL_PWR_IsActiveFlag_REGMS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_REGMS(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_REGMS) == (PWR_SR2_REGMS)) ? 1UL : 0UL);
}

/**
  * @brief  Get the Low Power Regulator ready status.
  * @rmtoll SR2      REGLPS         LL_PWR_IsActiveFlag_REGLPS
  * @retval State of Low Power Regulator (1=ready or 0=not ready).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_REGLPS(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_REGLPS) == (PWR_SR2_REGLPS)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMPS ready status.
  * @rmtoll SR2    PWR_SR2_SMPSRDY      LL_PWR_IsSMPSReady
  * @retval State of SMPS (1=ready or 0=not ready).
  */
__STATIC_INLINE uint32_t LL_PWR_IsSMPSReady(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_SMPSRDY) == (PWR_SR2_SMPSRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMPS RUN mode status.
  * @rmtoll SR2       PWR_SR2_SMPSENR         LL_PWR_IsSMPSinRUNMode
  * @retval SMPS RUN mode status (1=SMPS in RUN mode or 0=in PRECHARGE or NOSMPS mode).
  */
__STATIC_INLINE uint32_t LL_PWR_IsSMPSinRUNMode(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_SMPSENR) == (PWR_SR2_SMPSENR)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMPS PRECHARGE mode status.
  * @rmtoll SR2    PWR_SR2_SMPSBYPR     LL_PWR_IsSMPSinPRECHARGEMode
  * @retval SMPS PRECHARGE mode status (1=SMPS regulator is in PRECHARGE mode or 0=NOT in PRECHARGE).
  */
__STATIC_INLINE uint32_t LL_PWR_IsSMPSinPRECHARGEMode(void)
{
  return ((READ_BIT(PWR->SR2, PWR_SR2_SMPSBYPR) == (PWR_SR2_SMPSBYPR)) ? 1UL : 0UL);
}

/**
  * @brief  Set SMPS Mode.
  * @rmtoll CR5          PWR_CR5_NOSMPS           LL_PWR_SetSMPSMode
  * @param Mode SMPS Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS
  *         @arg @ref LL_PWR_NO_SMPS
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSMPSMode(uint32_t Mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_NOSMPS, Mode);
}

/**
  * @brief  Get SMPS Mode.
  * @rmtoll CR5          PWR_CR5_NOSMPS           LL_PWR_GetSMPSMode
  * @retval SMPS Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS
  *         @arg @ref LL_PWR_NO_SMPS
  */
__STATIC_INLINE uint32_t LL_PWR_GetSMPSMode(void)
{
  return (uint32_t)(READ_BIT(PWR->CR5, PWR_CR5_NOSMPS));
}

/**
  * @brief  Set SMPS in PRECHARGE Mode.
  * @rmtoll CR5          PWR_CR5_SMPSFBYP           LL_PWR_SetSMPSPrechargeMode
  * @param Mode SMPS in Precharge Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_NO_SMPS_PRECHARGE
  *         @arg @ref LL_PWR_SMPS_PRECHARGE
  * @retval None
  */
__STATIC_INLINE void  LL_PWR_SetSMPSPrechargeMode(uint32_t Mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSFBYP, Mode);
}

/**
  * @brief   Check if SMPS is configured in PRECHARGE Mode.
  * @rmtoll CR5          PWR_CR5_SMPSFBYP      LL_PWR_IsEnabledSMPSPrechargeMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSPrechargeMode(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_SMPSFBYP) == (PWR_CR5_SMPSFBYP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SMPS BOF (Bypass On the Fly).
  * @rmtoll CR5   PWR_CR5_NOSMPSBOF    LL_PWR_EnableSMPSBOF
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSBOF(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_NOSMPS_BOF);
}

/**
  * @brief  Disable SMPS BOF (Bypass On the Fly).
  * @rmtoll CR5   PWR_CR5_NOSMPSBOF    LL_PWR_DisableSMPSBOF
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSBOF(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_NOSMPS_BOF);
}

/**
  * @brief  Check if SMPS BOF (Bypass On the Fly) is enabled or not.
  * @rmtoll CR5   PWR_CR5_NOSMPSBOF    LL_PWR_IsEnabledSMPSBOF
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSBOF(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_NOSMPS_BOF) == (PWR_CR5_NOSMPS_BOF)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SMPS BOF Static.
  * @rmtoll CR5   PWR_CR5_SMPS_BOF_STATIC    LL_PWR_EnableSMPSBOFStatic
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSBOFStatic(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_STATIC);
}

/**
  * @brief  Disable SMPS BOF Static.
  * @rmtoll CR5   PWR_CR5_SMPS_BOF_STATIC   LL_PWR_DisableSMPSBOFStatic
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSBOFStatic(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_STATIC);
}

/**
  * @brief  Check if SMPS BOF Static is enabled or not.
  * @rmtoll CR5   PWR_CR5_SMPS_BOF_STATIC    LL_PWR_IsEnabledSMPSBOFStatic
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSBOFStatic(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_STATIC) == (PWR_CR5_SMPS_BOF_STATIC)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SMPS BOF Dynamic.
  * @rmtoll CR5   PWR_CR5_SMPS_BOF_DYN    LL_PWR_EnableSMPSBOFDynamic
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSBOFDynamic(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_DYN);
}

/**
  * @brief  Disable SMPS BOF Dynamic.
  * @rmtoll CR5   PWR_CR5_SMPS_BOF_DYN   LL_PWR_DisableSMPSBOFDynamic
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSBOFDynamic(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_DYN);
}

/**
  * @brief  Check if SMPS BOF Dynamic is enabled or not.
  * @rmtoll CR5   PWR_CR5_SMPS_BOF_DYN    LL_PWR_IsEnabledSMPSBOFDynamic
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSBOFDynamic(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_SMPS_BOF_DYN) == (PWR_CR5_SMPS_BOF_DYN)) ? 1UL : 0UL);
}

/**
  * @brief  Set SMPS OPEN Mode during DEEPSTOP.
  * @rmtoll CR5          PWR_CR5_NOSMPS           LL_PWR_SetSMPSOpenMode
  * @param  Mode SMPS Mode. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_NO_SMPS_LPOPEN
  *         @arg @ref LL_PWR_SMPS_LPOPEN
  */
__STATIC_INLINE void LL_PWR_SetSMPSOpenMode(uint32_t Mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSLPOPEN, Mode);
}

/**
  * @brief  Set SMPS BOM
  * @rmtoll CR5   PWR_CR5_SMPSBOMSEL_0/PWR_CR5_SMPSBOMSEL_1    LL_PWR_SetSMPSBOM
  * @param  BOM BOM. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_BOM1
  *         @arg @ref LL_PWR_SMPS_BOM2
  *         @arg @ref LL_PWR_SMPS_BOM3
  */
__STATIC_INLINE void LL_PWR_SetSMPSBOM(uint32_t BOM)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSBOMSEL, BOM);
}

/**
  * @brief  Get SMPS BOM
  * @rmtoll CR5   PWR_CR5_SMPSBOMSEL_0/PWR_CR5_SMPSBOMSEL_1    LL_PWR_GetSMPSBOM
  * @retval BOM. This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_BOM1
  *         @arg @ref LL_PWR_SMPS_BOM2
  *         @arg @ref LL_PWR_SMPS_BOM3
  */
__STATIC_INLINE uint32_t LL_PWR_GetSMPSBOM(void)
{
  return (uint32_t)(READ_BIT(PWR->CR5, PWR_CR5_SMPSBOMSEL));
}

/**
  * @brief  Set SMPS Output Level
  * @rmtoll CR5       SMPSLVL    LL_PWR_SMPS_SetOutputVoltageLevel
  * @param  OutputVoltageLevel Output Level. This parameter can be one of the values
  *         of the @arg @ref PWR_LL_SMPS_OUTLVL.
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V20
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V30
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V50
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V60
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V70
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V80
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_1V90
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_2V00
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_2V10
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_2V20
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_2V30
  *         @arg @ref LL_PWR_SMPS_OUTPUT_VOLTAGE_2V40
  * @retval None
  * @note   Please refer the user manual to know which levels are able for this
  *         feature.
  */
__STATIC_INLINE void LL_PWR_SMPS_SetOutputVoltageLevel(uint32_t OutputVoltageLevel)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPSLVL, OutputVoltageLevel);
}

/**
  * @brief  Get SMPS Output Level
  * @rmtoll CR5   PWR_CR5_SMPSLVL    LL_PWR_SMPS_GetOutputVoltageLevel
  * @retval Output Level. This parameter can be one of the values
  *         of the @arg @ref PWR_LL_SMPS_OUTLVL.
  * @note   Please refer the user manual to know which levels are able for this
  *         feature.
  */
__STATIC_INLINE uint32_t LL_PWR_SMPS_GetOutputVoltageLevel(void)
{
  return (uint32_t)(READ_BIT(PWR->CR5, PWR_CR5_SMPSLVL));
}

/**
  * @brief  Enable pull-up and pull-down configuration
  * @rmtoll CR1          APC           LL_PWR_EnablePUPDCfg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePUPDCfg(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_APC);
}

/**
  * @brief  Disable pull-up and pull-down configuration
  * @rmtoll CR1          APC           LL_PWR_DisablePUPDCfg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePUPDCfg(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_APC);
}

/**
  * @brief  Check if pull-up and pull-down configuration is enabled
  * @rmtoll CR1          APC           LL_PWR_IsEnabledPUPDCfg
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPUPDCfg(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_APC) == (PWR_CR1_APC)) ? 1UL : 0UL);
}

