stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_pwr.h
#if defined(PWR_ENGTRIM_TRIM_LSI_LPMU)
/**
  * @brief  Set Low Speed Internal oscillator LPMU trimming value.
  * @rmtoll ENGTRIM               LL_PWR_SetLPMULSITrim
  * @param  Trim Low Speed Internal oscillator trimming value
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetLSILPMUTrim(uint32_t Trim)
{
  MODIFY_REG(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_LSI_LPMU, ((Trim << PWR_ENGTRIM_TRIM_LSI_LPMU_Pos) & PWR_ENGTRIM_TRIM_LSI_LPMU));
  SET_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMLSILPMUEN);
}

/**
  * @brief  Get Low Speed Internal oscillator LPMU trimming value.
  * @rmtoll TRIMR/ENGTRIM               LL_PWR_GetLSITrim
  * @retval Low Speed Internal oscillator trimming value
  */
__STATIC_INLINE uint32_t LL_PWR_GetLSILPMUTrim(void)
{
  if (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMLSILPMUEN))
  {
    return (uint32_t)(READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_LSI_LPMU) >> PWR_ENGTRIM_TRIM_LSI_LPMU_Pos);
  }
  else
  {
    return (uint32_t)(READ_BIT(PWR->TRIMR, PWR_TRIMR_TRIM_LSI_LPMU) >> PWR_TRIMR_TRIM_LSI_LPMU_Pos);
  }
}
#endif /* PWR_ENGTRIM_TRIM_LSI_LPMU */

#if defined(PWR_ENGTRIM_TRIM_RFDREG)
/**
  * @brief  Set RF LDO trimming value.
  * @rmtoll ENGTRIM               LL_PWR_SetRFDREGTrim
  * @param  Trim RF LDO trimming value
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRFDREGTrim(uint32_t Trim)
{
  MODIFY_REG(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_RFDREG, ((Trim << PWR_ENGTRIM_TRIM_RFDREG_Pos) & PWR_ENGTRIM_TRIM_RFDREG));
  SET_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMRFDREGEN);
}

/**
  * @brief  Get RF LDO trimming value.
  * @rmtoll TRIMR/ENGTRIM               LL_PWR_GetRFDREGTrim
  * @retval RF LDO trimming value
  */
__STATIC_INLINE uint32_t LL_PWR_GetRFDREGTrim(void)
{
  if (READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIMRFDREGEN))
  {
    return (uint32_t)(READ_BIT(PWR->ENGTRIM, PWR_ENGTRIM_TRIM_RFDREG) >> PWR_ENGTRIM_TRIM_RFDREG_Pos);
  }
  else
  {
    return (uint32_t)(READ_BIT(PWR->TRIMR, PWR_TRIMR_RFD_REG_TRIM) >> PWR_TRIMR_RFD_REG_TRIM_Pos);
  }
}
#endif /* PWR_ENGTRIM_TRIM_RFDREG */

#if defined(PWR_CR5_SMPS_PRECH_CUR_SEL)
/**
  * @brief  Select SMPS PRECHARGE limit current.
  * @rmtoll CR5               LL_PWR_SetSMPSPrechargeLimitCurrent
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_2_5
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_5
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_10
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_20
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetSMPSPrechargeLimitCurrent(uint32_t Mode)
{
  MODIFY_REG(PWR->CR5, PWR_CR5_SMPS_PRECH_CUR_SEL, Mode);
}

/**
  * @brief  Get SMPS PRECHARGE limit current selected.
  * @rmtoll CR5               LL_PWR_GetSMPSPrechargeLimitCurrent
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_2_5
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_5
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_10
  *         @arg @ref LL_PWR_SMPS_PRECH_LIMIT_CUR_20
  */
__STATIC_INLINE uint32_t LL_PWR_GetSMPSPrechargeLimitCurrent(void)
{
  return (uint32_t)(READ_BIT(PWR->CR5, PWR_CR5_SMPS_PRECH_CUR_SEL));
}
#endif /* PWR_CR5_SMPS_PRECH_CUR_SEL */

#if defined(PWR_CR5_CLKDETR_DISABLE)
/**
  * @brief  Enable automatic SMPS bypass switching in case of unexpected loss of the SMPS clock.
  * @rmtoll CR5          PWR_CR5_CLKDETR_DISABLE           LL_PWR_EnableSMPSCLkDet
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSCLkDet(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_CLKDETR_DISABLE);
}

/**
  * @brief  Disable automatic SMPS bypass switching in case of unexpected loss of the SMPS clock.
  * @rmtoll CR5          PWR_CR5_CLKDETR_DISABLE           LL_PWR_DisableSMPSCLkDet
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSCLkDet(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_CLKDETR_DISABLE);
}

/**
  * @brief  Checks if automatic IBIAS control during RUN or DEEPSTOP mode is enabled or disabled.
  * @rmtoll CR5         PWR_CR5_CLKDETR_DISABLE      LL_PWR_IsEnabledSMPSCLkDet
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSCLkDet(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_CLKDETR_DISABLE) == (PWR_CR5_CLKDETR_DISABLE)) ? 0UL : 1UL);
}
#endif /* PWR_CR5_CLKDETR_DISABLE */

#if defined(PWR_CR5_SMPS_ENA_DCM)
/**
  * @brief  Enable Discontinuous conduction mode.
  * @rmtoll CR5          PWR_CR5_SMPS_ENA_DCM           LL_PWR_EnableSMPSDCM
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableSMPSDCM(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_SMPS_ENA_DCM);
}

/**
  * @brief  Disable Discontinuous conduction mode.
  * @rmtoll CR5          PWR_CR5_SMPS_ENA_DCM           LL_PWR_DisableSMPSDCM
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableSMPSDCM(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_SMPS_ENA_DCM);
}

/**
  * @brief  Checks if Discontinuous conduction mode is enabled or disabled.
  * @rmtoll CR5         PWR_CR5_SMPS_ENA_DCM      LL_PWR_IsEnabledSMPSDCM
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSMPSDCM(void)
{
  return ((READ_BIT(PWR->CR5, PWR_CR5_SMPS_ENA_DCM) == (PWR_CR5_SMPS_ENA_DCM)) ? 1UL : 0UL);
}
#endif /* PWR_CR5_SMPS_ENA_DCM */

/**
  * @}
  */

/** @defgroup PWR_LL_DBG_DEEPSTOP Function to setup the DEEPSTOP2 will be applied instead
  *                               of DEEPSTOP and the debugger features not lost
  * @{
  */

/**
  * @brief  Enable the DEEPSTOP2 feature, debugger feature not lost during DEEPSTOP.
  * @rmtoll DBGR               LL_PWR_EnableDEEPSTOP2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableDEEPSTOP2(void)
{
  SET_BIT(PWR->DBGR, PWR_DBGR_DEEPSTOP2);
}

/**
  * @brief  Disable the DEEPSTOP2 feature, debugger feature lost during DEEPSTOP.
  * @rmtoll DBGR               LL_PWR_DisableDEEPSTOP2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableDEEPSTOP2(void)
{
  CLEAR_BIT(PWR->DBGR, PWR_DBGR_DEEPSTOP2);
}

/**
  * @brief  Checks if the DEEPSTOP2 feature is enabled or disabled
  * @rmtoll DBGR               LL_PWR_IsEnabledDEEPSTOP2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledDEEPSTOP2(void)
{
  return ((READ_BIT(PWR->DBGR, PWR_DBGR_DEEPSTOP2) == (PWR_DBGR_DEEPSTOP2)) ? 1UL : 0UL);
}
/**
  * @}
  */

