stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_pwr.h
/** @defgroup PWR_LL_DEEPSTOP_GPIORET Functions to setup the GPIORET bit.
  *                                   GPIO retention
  * @{
  */

/**
  * @brief  Enable the GPIORET feature, GPIO retain their status during DEEPSTOP
  *         and exiting from DEEPSTOP.
  * @rmtoll CR2         GPIORET      LL_PWR_EnableGPIORET
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableGPIORET(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_GPIORET);
}

/**
  * @brief  Disable the GPIORET feature, don't retain their status during DEEPSTOP and exiting from DEEPSTOP.
  * @rmtoll CR2         GPIORET      LL_PWR_DisableGPIORET
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableGPIORET(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_GPIORET);
}

/**
  * @brief  Checks if the GPIO retention in DEEPSTOP feature is enabled or disabled
  * @rmtoll CR2         GPIORET      LL_PWR_IsEnabledGPIORET
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledGPIORET(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_GPIORET) == (PWR_CR2_GPIORET)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup PWR_LL_DEEPSTOP_DBGRET Functions to setup the DBGRET bit.
  *           GPIOA_Pin_2 and GPIOA_Pin_3 retention exiting from DEEPSTOP
  * @{
  */

/**
  * @brief  Enable the DBGRET feature, GPIOA_Pin_2 and GPIOA_Pin_3 retain their
  *         status during DEEPSTOP and exiting from DEEPSTOP.
  * @rmtoll CR2         DBGRET      LL_PWR_EnableDBGRET
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableDBGRET(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_DBGRET);
}

/**
  * @brief  Disable the DBGRET feature, GPIOA_Pin_2 and GPIOA_Pin_3 don't retain
  *         status during DEEPSTOP and exiting from DEEPSTOP.
  * @rmtoll CR2         DBGRET      LL_PWR_DisableDBGRET
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableDBGRET(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_DBGRET);
}

/**
  * @brief  Checks if the GPIOA_Pin_2 and GPIOA_Pin_3 retention in DEEPSTOP
  *         feature is enabled or disabled
  * @rmtoll CR2         DBGRET      LL_PWR_IsEnabledDBGRET
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledDBGRET(void)
{
  return ((READ_BIT(PWR->CR2, PWR_CR2_DBGRET) == (PWR_CR2_DBGRET)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup PWR_LL_EF_FLAG_MANAGEMENT PWR FLAG Management
  * @{
  */

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 0.
  * @rmtoll WUFA          WUF0            LL_PWR_IsActiveFlag_WUA0
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA0(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF0) == (PWR_WUFA_WUF0)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 1.
  * @rmtoll WUFA          WUF1            LL_PWR_IsActiveFlag_WUA1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA1(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF1) == (PWR_WUFA_WUF1)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 2.
  * @rmtoll WUFA          WUF2            LL_PWR_IsActiveFlag_WUA2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA2(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF2) == (PWR_WUFA_WUF2)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 3.
  * @rmtoll WUFA          WUF3            LL_PWR_IsActiveFlag_WUA3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA3(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF3) == (PWR_WUFA_WUF3)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 4.
  * @rmtoll WUFA          WUF4            LL_PWR_IsActiveFlag_WUA4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA4(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF4) == (PWR_WUFA_WUF4)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 5.
  * @rmtoll WUFA          WUF5            LL_PWR_IsActiveFlag_WUA5
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA5(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF5) == (PWR_WUFA_WUF5)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 6.
  * @rmtoll WUFA          WUF6            LL_PWR_IsActiveFlag_WUA6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA6(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF6) == (PWR_WUFA_WUF6)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 7.
  * @rmtoll WUFA          WUF7            LL_PWR_IsActiveFlag_WUA7
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA7(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF7) == (PWR_WUFA_WUF7)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 8.
  * @rmtoll WUFA          WUF8            LL_PWR_IsActiveFlag_WUA8
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA8(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF8) == (PWR_WUFA_WUF8)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 9.
  * @rmtoll WUFA          WUF9            LL_PWR_IsActiveFlag_WUA9
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA9(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF9) == (PWR_WUFA_WUF9)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 10.
  * @rmtoll WUFA          WUF10            LL_PWR_IsActiveFlag_WUA10
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA10(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF10) == (PWR_WUFA_WUF10)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 11.
  * @rmtoll WUFA          WUF11            LL_PWR_IsActiveFlag_WUA11
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA11(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF11) == (PWR_WUFA_WUF11)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 12.
  * @rmtoll WUFA          WUF12            LL_PWR_IsActiveFlag_WUA12
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA12(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF12) == (PWR_WUFA_WUF12)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 13.
  * @rmtoll WUFA          WUF13            LL_PWR_IsActiveFlag_WUA13
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA13(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF13) == (PWR_WUFA_WUF13)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 14.
  * @rmtoll WUFA          WUF14            LL_PWR_IsActiveFlag_WUA14
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA14(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF14) == (PWR_WUFA_WUF14)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 15.
  * @rmtoll WUFA          WUF15            LL_PWR_IsActiveFlag_WUA15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUA15(void)
{
  return ((READ_BIT(PWR->WUFA, PWR_WUFA_WUF15) == (PWR_WUFA_WUF15)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Wake-up Flag WUFA0
  * @rmtoll WUFA     WUF0          LL_PWR_ClearFlag_WUA0
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA0(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF0);
}

/**
  * @brief  Clear Wake-up Flag WUFA1
  * @rmtoll WUFA     WUF1          LL_PWR_ClearFlag_WUA1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA1(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF1);
}
/**
  * @brief  Clear Wake-up Flag WUFA2
  * @rmtoll WUFA     WUF2          LL_PWR_ClearFlag_WUA2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA2(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF2);
}
/**
  * @brief  Clear Wake-up Flag WUFA3
  * @rmtoll WUFA     WUF3          LL_PWR_ClearFlag_WUA3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA3(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF3);
}
/**
  * @brief  Clear Wake-up Flag WUFA4
  * @rmtoll WUFA     WUF4          LL_PWR_ClearFlag_WUA4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA4(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF4);
}

/**
  * @brief  Clear Wake-up Flag WUFA5
  * @rmtoll WUFA     WUF5          LL_PWR_ClearFlag_WUA5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA5(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF5);
}

/**
  * @brief  Clear Wake-up Flag WUFA6
  * @rmtoll WUFA     WUF6          LL_PWR_ClearFlag_WUA6
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA6(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF6);
}

/**
  * @brief  Clear Wake-up Flag WUFA7
  * @rmtoll WUFA     WUF7          LL_PWR_ClearFlag_WUA7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA7(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF7);
}

/**
  * @brief  Clear Wake-up Flag WUFA8
  * @rmtoll WUFA     WUF8          LL_PWR_ClearFlag_WUA8
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA8(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF8);
}

/**
  * @brief  Clear Wake-up Flag WUFA9
  * @rmtoll WUFA     WUF9          LL_PWR_ClearFlag_WUA9
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA9(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF9);
}

/**
  * @brief  Clear Wake-up Flag WUFA10
  * @rmtoll WUFA     WUF10          LL_PWR_ClearFlag_WUA10
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA10(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF10);
}

/**
  * @brief  Clear Wake-up Flag WUFA11
  * @rmtoll WUFA     WUF11          LL_PWR_ClearFlag_WUA11
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA11(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF11);
}

/**
  * @brief  Clear Wake-up Flag WUFA12
  * @rmtoll WUFA     WUF12          LL_PWR_ClearFlag_WUA12
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA12(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF12);
}

/**
  * @brief  Clear Wake-up Flag WUFA13
  * @rmtoll WUFA     WUF13          LL_PWR_ClearFlag_WUA13
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA13(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF13);
}

/**
  * @brief  Clear Wake-up Flag WUFA14
  * @rmtoll WUFA     WUF14          LL_PWR_ClearFlag_WUA14
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA14(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF14);
}

/**
  * @brief  Clear Wake-up Flag WUFA15
  * @rmtoll WUFA     WUF15          LL_PWR_ClearFlag_WUA15
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUA15(void)
{
  WRITE_REG(PWR->WUFA, PWR_WUFA_WUF15);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 0.
  * @rmtoll WUFB          WUF0            LL_PWR_IsActiveFlag_WUB0
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB0(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF0) == (PWR_WUFB_WUF0)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 1.
  * @rmtoll WUFB          WUF1            LL_PWR_IsActiveFlag_WUB1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB1(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF1) == (PWR_WUFB_WUF1)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 2.
  * @rmtoll WUFB          WUF2            LL_PWR_IsActiveFlag_WUB2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB2(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF2) == (PWR_WUFB_WUF2)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 3.
  * @rmtoll WUFB          WUF3            LL_PWR_IsActiveFlag_WUB3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB3(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF3) == (PWR_WUFB_WUF3)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 4.
  * @rmtoll WUFB          WUF4            LL_PWR_IsActiveFlag_WUB4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB4(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF4) == (PWR_WUFB_WUF4)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 5.
  * @rmtoll WUFB          WUF5            LL_PWR_IsActiveFlag_WUB5
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB5(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF5) == (PWR_WUFB_WUF5)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 6.
  * @rmtoll WUFB          WUF6            LL_PWR_IsActiveFlag_WUB6
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB6(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF6) == (PWR_WUFB_WUF6)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 7.
  * @rmtoll WUFB          WUF7            LL_PWR_IsActiveFlag_WUB7
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB7(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF7) == (PWR_WUFB_WUF7)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 8.
  * @rmtoll WUFB          WUF8            LL_PWR_IsActiveFlag_WUB8
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB8(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF8) == (PWR_WUFB_WUF8)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 9.
  * @rmtoll WUFB          WUF9            LL_PWR_IsActiveFlag_WUB9
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB9(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF9) == (PWR_WUFB_WUF9)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 10.
  * @rmtoll WUFB          WUF10            LL_PWR_IsActiveFlag_WUB10
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB10(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF10) == (PWR_WUFB_WUF10)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 11.
  * @rmtoll WUFB          WUF11            LL_PWR_IsActiveFlag_WUB11
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB11(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF11) == (PWR_WUFB_WUF11)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 12.
  * @rmtoll WUFB          WUF12            LL_PWR_IsActiveFlag_WUB12
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB12(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF12) == (PWR_WUFB_WUF12)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 13.
  * @rmtoll WUFB          WUF13            LL_PWR_IsActiveFlag_WUB13
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB13(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF13) == (PWR_WUFB_WUF13)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 14.
  * @rmtoll WUFB          WUF14            LL_PWR_IsActiveFlag_WUB14
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB14(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF14) == (PWR_WUFB_WUF14)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 15.
  * @rmtoll WUFB          WUF15            LL_PWR_IsActiveFlag_WUB15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WUB15(void)
{
  return ((READ_BIT(PWR->WUFB, PWR_WUFB_WUF15) == (PWR_WUFB_WUF15)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Wake-up Flag WUFB0
  * @rmtoll WUFB     WUF0          LL_PWR_ClearFlag_WUB0
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB0(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF0);
}

/**
  * @brief  Clear Wake-up Flag WUFB1
  * @rmtoll WUFB     WUF1          LL_PWR_ClearFlag_WUB1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB1(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF1);
}
/**
  * @brief  Clear Wake-up Flag WUFB2
  * @rmtoll WUFB     WUF2          LL_PWR_ClearFlag_WUB2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB2(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF2);
}
/**
  * @brief  Clear Wake-up Flag WUFB3
  * @rmtoll WUFB     WUF3          LL_PWR_ClearFlag_WUB3
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB3(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF3);
}
/**
  * @brief  Clear Wake-up Flag WUFB4
  * @rmtoll WUFB     WUF4          LL_PWR_ClearFlag_WUB4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB4(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF4);
}

/**
  * @brief  Clear Wake-up Flag WUFB5
  * @rmtoll WUFB     WUF5          LL_PWR_ClearFlag_WUB5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB5(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF5);
}

/**
  * @brief  Clear Wake-up Flag WUFB6
  * @rmtoll WUFB     WUF6          LL_PWR_ClearFlag_WUB6
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB6(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF6);
}

/**
  * @brief  Clear Wake-up Flag WUFB7
  * @rmtoll WUFB     WUF7          LL_PWR_ClearFlag_WUB7
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB7(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF7);
}

/**
  * @brief  Clear Wake-up Flag WUFB8
  * @rmtoll WUFB     WUF8          LL_PWR_ClearFlag_WUB8
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB8(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF8);
}

/**
  * @brief  Clear Wake-up Flag WUFB9
  * @rmtoll WUFB     WUF9          LL_PWR_ClearFlag_WUB9
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB9(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF9);
}

/**
  * @brief  Clear Wake-up Flag WUFB10
  * @rmtoll WUFB     WUF10          LL_PWR_ClearFlag_WUB10
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB10(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF10);
}

/**
  * @brief  Clear Wake-up Flag WUFB11
  * @rmtoll WUFB     WUF11          LL_PWR_ClearFlag_WUB11
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB11(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF11);
}

/**
  * @brief  Clear Wake-up Flag WUFB12
  * @rmtoll WUFB     WUF12          LL_PWR_ClearFlag_WUB12
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB12(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF12);
}

/**
  * @brief  Clear Wake-up Flag WUFB13
  * @rmtoll WUFB     WUF13          LL_PWR_ClearFlag_WUB13
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB13(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF13);
}

/**
  * @brief  Clear Wake-up Flag WUFB14
  * @rmtoll WUFB     WUF14          LL_PWR_ClearFlag_WUB14
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB14(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF14);
}

/**
  * @brief  Clear Wake-up Flag WUFB15
  * @rmtoll WUFB     WUF15          LL_PWR_ClearFlag_WUB15
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WUB15(void)
{
  WRITE_REG(PWR->WUFB, PWR_WUFB_WUF15);
}

/**
  * @brief  Clear internal Wake-up Flag LPUART
  * @rmtoll IWUF     IWUF0          LL_PWR_ClearFlag_LPUART
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_LPUART(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_IWUF0);
}

/**
  * @brief  Clear internal Wake-up Flag RTC
  * @rmtoll IWUF     IWUF1          LL_PWR_ClearFlag_RTC
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_RTC(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_IWUF1);
}

/**
  * @brief  Clear internal Wake-up Flag LCD
  * @rmtoll IWUF     IWUF2          LL_PWR_ClearFlag_LCD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_LCD(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_IWUF2);
}

/**
  * @brief  Clear internal Wake-up Flag COMP
  * @rmtoll IWUF     IWUF3          LL_PWR_ClearFlag_LCD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_COMP(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_IWUF3);
}

/**
  * @brief  Clear internal Wake-up Flag LCSC
  * @rmtoll IWUF     IWUF4          LL_PWR_ClearFlag_LCSC
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_LCSC(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_IWUF4);
}

/**
  * @brief  Clear internal Wake-up Flag MRSUBG
  * @rmtoll IWUF     WMRSUBGF          LL_PWR_ClearFlag_MRSUBG
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_MRSUBG(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_WMRSUBGF);
}

/**
  * @brief  Clear MRSUBG Host CPU wakeup flag
  * @rmtoll IWUF     WMRSUBGHCPUF          LL_PWR_ClearFlag_MRSUBGHCPU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_MRSUBGHCPU(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_WMRSUBGHCPUF);
}

/**
  * @brief  Clear LPAWUR wakeup flag
  * @rmtoll IWUF     WLPAWURF          LL_PWR_ClearFlag_LPAWUR
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearFlag_LPAWUR(void)
{
  WRITE_REG(PWR->IWUF, PWR_IWUF_WLPAWURF);
}

/**
  * @}
  */

/** @defgroup PWR_LL_RF_DEEPSTOP_FLAG flags about RF radio activity start and DEEPSTOP sequence occurred.
  * @{
  */

/**
  * @brief  Check if a radio wakeup event occurs.
  * @rmtoll EXTSRR         RFPHASEF      LL_PWR_GetRFWakeupFlag
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_GetRFWakeupFlag(void)
{
  return ((READ_BIT(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF) == (PWR_EXTSRR_RFPHASEF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear radio wakeup event occurs flag.
  * @rmtoll EXTSRR         RFPHASEF      LL_PWR_ClearRFWakeupFlag
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearRFWakeupFlag(void)
{
  WRITE_REG(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF);
}

/**
  * @brief  Check if a DEEPSTOP sequence occurred.
  * @rmtoll EXTSRR         DEEPSTOPF      LL_PWR_GetDeepstopSeqFlag
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_GetDeepstopSeqFlag(void)
{
  return ((READ_BIT(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF) == (PWR_EXTSRR_DEEPSTOPF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear DEEPSTOP sequence occurred flag.
  * @rmtoll EXTSRR         DEEPSTOPF      LL_PWR_ClearDeepstopSeqFlag
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ClearDeepstopSeqFlag(void)
{
  WRITE_REG(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF);
}
/**
  * @}
  */

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup PWR_LL_Init De-initialization function
  * @{
  */
ErrorStatus LL_PWR_DeInit(void);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

#endif /* defined(PWR) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WL3x_LL_PWR_H */
